Revit 2022 API
STLExportResolution Enumeration
 An enumerated type listing possible options to control the tessellation quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2021.1
Since: 2021.1
Syntax
C#
public enum STLExportResolution
Visual Basic
Public Enumeration STLExportResolution
Visual C++
public enum class STLExportResolution
Members
Member name | Description
Custom |  STL exporting with custom resolution (all possible STL tessellation parameters have default values).
Fine |  STL exporting with fine resolution.
Medium |  STL exporting with medium resolution.
Coarse |  STL exporting with coarse resolution.
See Also
Autodesk.Revit.DB Namespace